# PANDAS FINAL

In [ ]:
Pandas is a Python library for data analysis pandas is a fast, powerful, flexible and easy to use open source data analysis and mainpulation 
tool built on top of the Python Programming language.

In [1]:
import pandas as pd

# Indexing and Slicing

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(8,4),columns=['A','B','C','D'])
df

          A         B         C         D
0  0.474745 -0.814132  0.689801  0.020251
1  1.691887 -0.525118 -0.316459 -0.322930
2  1.045232  0.399069 -0.985414  0.498189
3 -1.735634 -1.763083 -1.618113 -0.309598
4 -1.891359 -0.471079  1.459791 -0.366201
5 -2.538030 -0.420878  0.278376  0.610504
6  0.040096 -0.316265  1.319750 -0.708806
7  0.855700 -0.648830 -0.830927 -1.577529

In [3]:
df.iloc[1:4,2]

1   -0.316459
2   -0.985414
3   -1.618113
Name: C, dtype: float64

In [4]:
df.iloc[2:7,1:4]

          B         C         D
2  0.399069 -0.985414  0.498189
3 -1.763083 -1.618113 -0.309598
4 -0.471079  1.459791 -0.366201
5 -0.420878  0.278376  0.610504
6 -0.316265  1.319750 -0.708806

In [5]:
df.iloc[:,-1]  # negative slicing

0    0.020251
1   -0.322930
2    0.498189
3   -0.309598
4   -0.366201
5    0.610504
6   -0.708806
7   -1.577529
Name: D, dtype: float64

In [6]:
df.iloc[:,-2]

0    0.689801
1   -0.316459
2   -0.985414
3   -1.618113
4    1.459791
5    0.278376
6    1.319750
7   -0.830927
Name: C, dtype: float64

In [7]:
df.iloc[:,-3:-1]

          B         C
0 -0.814132  0.689801
1 -0.525118 -0.316459
2  0.399069 -0.985414
3 -1.763083 -1.618113
4 -0.471079  1.459791
5 -0.420878  0.278376
6 -0.316265  1.319750
7 -0.648830 -0.830927

In [8]:
df.iloc[:,-4:-2]

          A         B
0  0.474745 -0.814132
1  1.691887 -0.525118
2  1.045232  0.399069
3 -1.735634 -1.763083
4 -1.891359 -0.471079
5 -2.538030 -0.420878
6  0.040096 -0.316265
7  0.855700 -0.648830

In [9]:
df.iloc[:,-4]

0    0.474745
1    1.691887
2    1.045232
3   -1.735634
4   -1.891359
5   -2.538030
6    0.040096
7    0.855700
Name: A, dtype: float64

In [10]:
df.iloc[:,-4:]

          A         B         C         D
0  0.474745 -0.814132  0.689801  0.020251
1  1.691887 -0.525118 -0.316459 -0.322930
2  1.045232  0.399069 -0.985414  0.498189
3 -1.735634 -1.763083 -1.618113 -0.309598
4 -1.891359 -0.471079  1.459791 -0.366201
5 -2.538030 -0.420878  0.278376  0.610504
6  0.040096 -0.316265  1.319750 -0.708806
7  0.855700 -0.648830 -0.830927 -1.577529

In [11]:
df.iloc[:,:-1]   # it means -4 to -1 and -1 me n-1 rule follow hua hai

          A         B         C
0  0.474745 -0.814132  0.689801
1  1.691887 -0.525118 -0.316459
2  1.045232  0.399069 -0.985414
3 -1.735634 -1.763083 -1.618113
4 -1.891359 -0.471079  1.459791
5 -2.538030 -0.420878  0.278376
6  0.040096 -0.316265  1.319750
7  0.855700 -0.648830 -0.830927

In [12]:
df.iloc[:,-4:-1]

          A         B         C
0  0.474745 -0.814132  0.689801
1  1.691887 -0.525118 -0.316459
2  1.045232  0.399069 -0.985414
3 -1.735634 -1.763083 -1.618113
4 -1.891359 -0.471079  1.459791
5 -2.538030 -0.420878  0.278376
6  0.040096 -0.316265  1.319750
7  0.855700 -0.648830 -0.830927

In [ ]:
# Negative Indexing
do -- df.iloc[2:6,-4:-2]
             [3:7,-3:-1]
             [:,-4:-1]
             [:,-2:-1]
             [1:4,-4:]

In [28]:
df = pd.DataFrame({'Day' : [1,2,3,4],'Visitors' : [200,100,230,300], 'Bounce_Rate' :[20,45,60,10]})
print(df)

   Day  Visitors  Bounce_Rate
0    1       200           20
1    2       100           45
2    3       230           60
3    4       300           10

In [29]:
df.set_index("Day")

     Visitors  Bounce_Rate
Day
1         200           20
2         100           45
3         230           60
4         300           10

In [30]:
df1

     Visitors  Bounce_Rate
Day
1         200           20
2         100           45
3         230           60
4         300           10

In [31]:
df     # original value not change

   Day  Visitors  Bounce_Rate
0    1       200           20
1    2       100           45
2    3       230           60
3    4       300           10

In [32]:
df.set_index("Day",inplace=True)  # inplace = true use se hum change kr skte hai original data

In [35]:
df

     Visitors  Bounce_Rate
Day
1         200           20
2         100           45
3         230           60
4         300           10

Change the column Headers                                                                                            
                                                                                                             
Let us now change the headers of column in this python pandas tutorial. Let us take the same example, where i will change 
the column header from "Visitors" to "Users". So let me implement it practically.

In [36]:
df = df.rename(columns = {"visitors":"Users"})
print(df)

     Visitors  Bounce_Rate
Day
1         200           20
2         100           45
3         230           60
4         300           10

# Data analysis in python

In [19]:
import pandas as pd

data = {'Day': [1,2,3,4,5,6], "visitors":[1000,700,6000,1000,400,350],"Bounce_Rate":[20,20,23,15,10,34]}
df = pd.DataFrame(data)
print(df)

   Day  visitors  Bounce_Rate
0    1      1000           20
1    2       700           20
2    3      6000           23
3    4      1000           15
4    5       400           10
5    6       350           34

In [20]:
df.head()    # top five rows

   Day  visitors  Bounce_Rate
0    1      1000           20
1    2       700           20
2    3      6000           23
3    4      1000           15
4    5       400           10

In [21]:
df.tail()  # bottom five row

   Day  visitors  Bounce_Rate
1    2       700           20
2    3      6000           23
3    4      1000           15
4    5       400           10
5    6       350           34

In [22]:
df.head(3) # pass perimeter 3 then top 3 rows show

   Day  visitors  Bounce_Rate
0    1      1000           20
1    2       700           20
2    3      6000           23

In [23]:
df.tail(3)  # bottom three rows

   Day  visitors  Bounce_Rate
3    4      1000           15
4    5       400           10
5    6       350           34

In [24]:
df.sample()

   Day  visitors  Bounce_Rate
1    2       700           20

In [25]:
df.sample(2)  # sample show any second row

   Day  visitors  Bounce_Rate
3    4      1000           15
2    3      6000           23

In [26]:
df.sample(4)   # sample show any four row this is not fix

   Day  visitors  Bounce_Rate
4    5       400           10
0    1      1000           20
2    3      6000           23
5    6       350           34

In [30]:
import pandas as pd

data = {'Day': [1,2,3,4,5,6], "visitors":[1000,700,6000,1000,400,350],"Bounce_Rate":[20,20,23,15,10,34]}
df = pd.DataFrame(data)
print(df)

   Day  visitors  Bounce_Rate
0    1      1000           20
1    2       700           20
2    3      6000           23
3    4      1000           15
4    5       400           10
5    6       350           34